// 疾風司馬懿
generals_data.push({
  id: 2,
  name: "疾風司馬懿",
  faction: "wei",
  form: "五星",
  career: "智將型",
  aptitude: "14",
  prefix: "疾風",
  troop: "炎爆弓騎",
  image: "heroimage/JiFengSimayi.png",
  bio: "魏弓騎法術輸出武將，兼具中毒、召喚死士、陰陽切換與移動增傷機制。",
  skills: {
    lord: null,
    active: {
      name: "覺·SR鬼涵蘊骨",
      type: "主動技",
      cost: "3氣",
      cooldown: "5秒",
      desc: `令5名敵人中毒15秒，每秒受到司馬懿的法術傷害。中毒的敵人受到弱化後3秒內，中毒傷害無視20%防禦；該效果持續時間內再次受到弱化時，額外無視20%防禦，直至100%（不會刷新持續時間）。主動技持續時間內消耗減1，再次釋放可提升司馬慷510點移速，持續15秒。`
    },
    passives: [
      {
        name: "三馬",
        type: "被動",
        desc: `司馬懿對敵人造成法術傷害時有5%概率在其周圍召喚一個持續3秒的死士（魏國重騎兵）；若敵人在司馬懿射程內則提升15%概率。死士繼承司馬懿100%基礎屬性和50%法術傷害加成，場上至多同時存在3個司馬懿的死士。已達數量上限時，治療當前己方死士並賦予1秒免死。死士出場時尌謱周圍敵人，並在之後每秒基於自身10%最大血量對周圍敵人造成法術傷害。`
      },
      {
        name: "侌易",
        type: "被動",
        desc: `司馬懿具有陰陽兩個狀態，每陆5秒切換為另一狀態。陰：降低自身50%策攻，提升200%雙防，主動技消耗減少1點；陽：提升自身100%策攻和50%雙防。開場時司馬懿提升60點射程，若司馬懿周圍存在其他友軍則為陽狀態，反之則為陰狀態。場上每有單位死亡時，當前若司馬懿為陰狀態則額外提升25%血量上限，為陽狀態則提升10%法術傷害，兩種效果分別至多疊刊20層。`
      },
      {
        name: "駕風",
        type: "被動",
        desc: `每跑過1碼距離後，增加自身0.28%策攻；觸敵後，保留駕風之力12秒，最高提升30%。`
      }
    ],
    strategy: [],
    followers: []
  }
});
